# Запуск окружения python3 -m venv selenium_env
# source selenium_env/bin/activate
# Декативируем deactivate
# Запуск интерпритатора python3
# Когда открываете новое окно терминала, нужно заново активировать виртуальное окружение.

# Задача 1
import math
fun = lambda x : 1 if x == 1 else math.ceil(math.sinh(fun (x-1)))
print(fun(5))
#723128532146

# Задача 2
# driver.get()






