# Поиск с помощью CSS-селекторов, когда путь к элементу описывается через синтаксис CSS. Селектор — это описание пути к элементу на странице.
# Поиск с помощью указания значений тегов или атрибутов элементов: ID, class, и т.д.
# Поиск с помощью языка запросов XPath.

#Tag – элемент или тег
#<p>Здесь написан текст.</p>
#<br> - этому тегу закрывающий тег не нужен, тег для переноса строки

#Attribute – атрибуты или свойства элемента

#Атрибут href, который задаёт ссылку для тега <a> <a href="/about">Посмотреть подробнее</a>

#Атрибут class - <div class="simple-text main">Здесь написан текст.</div>

#Атрибут name  -   <a name="top"></a>
#<p>Длинный текст</p>
#<p><a href="#top">Наверх</a></p>

#Атрибут id - <button id="save_button">Сохранить</button>

#если увидите нечеловекочитаемое значение атрибута или если значение атрибута меняется при перезагрузке страницы,
# то не используйте его!!

#Иерархия в HTML-документах
#1) потомок элемента X – элемент любой степени вложенности внутри элемента X;
#2) ребёнок или дочерний элемент — прямой потомок (т.е. элемент на первом уровне вложенности);
#3) предок элемента Y – любой элемент X, который включает в себя элемент Y;
#4) родитель — это прямой предок (т.е. элемент, который расположен выше строго на 1 уровень);
#5) братский или соседний элемент – элемент X, который расположен на одном уровне иерархии с элементом Y. Элементы X и Y имеют одного родителя.

# Задание 1
# input

# Задание 2
# если будете читать, то справитесь сами, все очень просто!

# Подробнее об атрибутах (data-атрибуты)
# Задача 3
# если будете читать, то справитесь сами, все очень просто!
